IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_gpio_ctrl_regs.xml
	<register id="GPCMUX2" width="32" page="1" offset="0x88" internal="0" description="GPIO C Mux 2 Register (GPIO80  to 95)">
		<bitfield id="GPIO80" description="Defines pin-muxing selection for GPIO80" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Defines pin-muxing selection for GPIO81" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Defines pin-muxing selection for GPIO82" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Defines pin-muxing selection for GPIO83" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Defines pin-muxing selection for GPIO84" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Defines pin-muxing selection for GPIO85" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Defines pin-muxing selection for GPIO86" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Defines pin-muxing selection for GPIO87" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Defines pin-muxing selection for GPIO88" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Defines pin-muxing selection for GPIO89" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Defines pin-muxing selection for GPIO90" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Defines pin-muxing selection for GPIO91" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Defines pin-muxing selection for GPIO92" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Defines pin-muxing selection for GPIO93" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Defines pin-muxing selection for GPIO94" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Defines pin-muxing selection for GPIO95" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPCDIR" width="32" page="1" offset="0x8a" internal="0" description="GPIO C Direction Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPCPUD" width="32" page="1" offset="0x8c" internal="0" description="GPIO C Pull Up Disable Register (GPIO64 to 95) ">
		<bitfield id="GPIO64" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
