IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_gpio_ctrl_regs.xml
	<register id="GPFDIR" width="32" page="1" offset="0x14a" internal="0" description="GPIO F Direction Register (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFPUD" width="32" page="1" offset="0x14c" internal="0" description="GPIO F Pull Up Disable Register (GPIO160 to 168) ">
		<bitfield id="GPIO160" description="Pull-Up Disable control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Pull-Up Disable control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Pull-Up Disable control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Pull-Up Disable control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Pull-Up Disable control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Pull-Up Disable control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFINV" width="32" page="1" offset="0x150" internal="0" description="GPIO F Input Polarity Invert Registers (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Input inversion control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Input inversion control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Input inversion control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Input inversion control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Input inversion control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Input inversion control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFODR" width="32" page="1" offset="0x152" internal="0" description="GPIO F Open Drain Output Register (GPIO160 to GPIO168)">
		<bitfield id="GPIO160" description="Outpout Open-Drain control for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Outpout Open-Drain control for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Outpout Open-Drain control for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Outpout Open-Drain control for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Outpout Open-Drain control for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Outpout Open-Drain control for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Outpout Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Outpout Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Outpout Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFGMUX1" width="32" page="1" offset="0x160" internal="0" description="GPIO F Peripheral Group Mux (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Defines pin-muxing selection for GPIO160" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Defines pin-muxing selection for GPIO161" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Defines pin-muxing selection for GPIO162" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Defines pin-muxing selection for GPIO163" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Defines pin-muxing selection for GPIO164" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Defines pin-muxing selection for GPIO165" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Defines pin-muxing selection for GPIO166" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Defines pin-muxing selection for GPIO167" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Defines pin-muxing selection for GPIO168" begin="17" end="16" width="2" rwaccess="RW"/>
	</register>
	<register id="GPFCSEL1" width="32" page="1" offset="0x168" internal="0" description="GPIO F Core Select Register (GPIO160 to 167)">
		<bitfield id="GPIO160" description="GPIO160 Master CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO161" description="GPIO161 Master CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO162" description="GPIO162 Master CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO163" description="GPIO163 Master CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO164" description="GPIO164 Master CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO165" description="GPIO165 Master CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO166" description="GPIO166 Master CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO167" description="GPIO167 Master CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPFCSEL2" width="32" page="1" offset="0x16a" internal="0" description="GPIO F Core Select Register (GPIO168)">
		<bitfield id="GPIO168" description="GPIO168 Master CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="GPFLOCK" width="32" page="1" offset="0x17c" internal="0" description="GPIO F Lock Configuration Register (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFCR" width="32" page="1" offset="0x17e" internal="0" description="GPIO F Lock Commit Register (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
</module>
